uhnp/src/Reports/ЭффективностьОбработкиДокументов/ЭффективностьОбработкиДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ЭффективностьОбработкиДокументов</name>
</mdclass:Report>

uhnp/src/InformationRegisters/НормативыОтработкиДокументов/НормативыОтработкиДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НормативыОтработкиДокументов</name>
  <resources>
    <name>Норматив</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументБД</name>
    <type>
      <types>CatalogRef.ДокументыБД</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ТекущиеКадровыеДанныеСотрудников/ТекущиеКадровыеДанныеСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТекущиеКадровыеДанныеСотрудников</name>
  <resources>
    <name>ТекущееПодразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>ТекущаяДолжность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>ДатаУвольнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОсновноеРабочееМестоВОрганизации</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьТекущаяДолжностьПоШтатномуРасписанию</name>
    <type>
      <types>CatalogRef.ШтатноеРасписание</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПриема</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТекущийВидЗанятости</name>
    <type>
      <types>EnumRef.ВидыЗанятости</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьТекущийВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровССотрудниками</types>
    </type>
  </resources>
  <resources>
    <name>ОформленПоТрудовомуДоговору</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьТекущаяТерритория</name>
    <type>
      <types>CatalogRef.ТерриторииВыполненияРабот</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>22</precision>
        <scale>20</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>тнПодразделение</name>
    <comment>Выполнение задач №000041300</comment>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТекущаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/ДоступныеПериодыОтчета/ДоступныеПериодыОтчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ДоступныеПериодыОтчета</name>
  <enumValues>
    <name>День</name>
  </enumValues>
  <enumValues>
    <name>Неделя</name>
  </enumValues>
  <enumValues>
    <name>Декада</name>
  </enumValues>
  <enumValues>
    <name>Месяц</name>
  </enumValues>
  <enumValues>
    <name>Квартал</name>
  </enumValues>
  <enumValues>
    <name>Полугодие</name>
  </enumValues>
  <enumValues>
    <name>Год</name>
  </enumValues>
  <enumValues>
    <name>ПроизвольныйПериод</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/ДокументыБД/ДокументыБД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДокументыБД</name>
  <comment>Содержит реквизиты, необходимые для выборки данных из текущей и внешних информационных баз</comment>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ТипыБазДанных</owners>
  <attributes>
    <name>Синоним</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОбъектаМетаданных</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиОбменаДокументами</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьПриНеудачномПоискеПриИмпорте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбновлятьРеквизитыПриИмпорте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяВПроцессе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокументаБД</name>
    <type>
      <types>EnumRef.ТипыДокументовБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонДокументаБД</name>
    <type>
      <types>DefinedType.ШаблонДокументаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласуется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитСостояния</name>
    <type>
      <types>CatalogRef.ПеречисленияБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеРеквизитаСостоянияЧерновик</name>
    <type>
      <types>EnumRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеРеквизитаСостоянияНаУтверждении</name>
    <type>
      <types>EnumRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеРеквизитаСостоянияУтвержден</name>
    <type>
      <types>EnumRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеРеквизитаСостоянияОтклонен</name>
    <type>
      <types>EnumRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьШаблоны</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитШаблонаДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДляАналитики1УП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДляАналитики2УП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДляАналитики3УП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяВНастройкахРеглмента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьПравилоРасчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьПравилоПроверки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьБланк</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьСпособФормирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьУниверсальныйИмпорт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьШаблонТрансляции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчастокУчета</name>
    <type>
      <types>CatalogRef.УчасткиУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитСостоянияСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитРазделенияПоПроектам</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазделятьПоПроектам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделятьПоОрганизациям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитРазделенияПоОрганизациям</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитКонтрагент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДоговорКонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитСуммыДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеБлокироватьРеквизитыПриУтверждении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОтсутствуетВКонфигурации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтсутствуетВКонфигурации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>тн_НеОтражатьВУУ</name>
    <comment>// Гутарова Екатерина 03.05.2023 Выполнение задач №000045368</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Синоним1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Синоним2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбязателенКомментарий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СогласуетсяВДокументообороте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Реквизиты</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Синоним</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипДанных</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Обязательный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИспользоватьДляСогласования</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Отображать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерАналитики</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеПримитивногоТипа</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Синоним1</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Синоним2</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДопРеквизитыМатрицыПроцесса</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьДоступныеФормыСхемРеквизитов</name>
    <attributes>
      <name>ИмяДоступнойФормы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоступныеФормыСхемРеквизитов</name>
    <attributes>
      <name>ИмяДоступнойФормы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Reports/ЭффективностьОбработкиДокументов/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДокументыБД = ПолучитьДокументыБД(КомпоновщикНастроек.ПолучитьНастройки());
	
	Если ДокументыБД.Строки.Количество() = 0 Тогда
		
		Сообщить("Для документов БД не указаны участки учета!");
		Возврат;
		
	КонецЕсли;
		
	ПараметрыЗапроса = ПолучитьТекстЗапросаПоДокументамБД(ДокументыБД);
	
	СхемаКД = ПолучитьСКД(ПараметрыЗапроса);
	
	НастройкиИсточник = КомпоновщикНастроек.ПолучитьНастройки();
	НастройкиСКД = ПолучитьНастройкиСКД(НастройкиИсточник, ПараметрыЗапроса);
	
	МакетКД = ТиповыеОтчетыУХ.ПолучитьМакетКомпоновкиДанныхКоллекции(
								СхемаКД, 
								НастройкиСКД, 
								ДанныеРасшифровки,,, 
								Тип("ГенераторМакетаКомпоновкиДанных"));
	
    ПроцессорКД = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКД.Инициализировать(МакетКД,, ДанныеРасшифровки);
	
    ПроцессорВыводаСКД = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВыводаСКД.УстановитьДокумент(ДокументРезультат);	
	
	Попытка
		ПроцессорВыводаСКД.Вывести(ПроцессорКД);	
	Исключение
	    Сообщить(ОписаниеОшибки());
	КонецПопытки;	
	
КонецПроцедуры

Функция ПолучитьСКД(ПараметрыЗапроса)
    
    СхемаКД = ТиповыеОтчетыУХ.ПолучитьСхемуКомпоновкиДанных(ПараметрыЗапроса.Текст);
    
	КопируемыеСвойства = Новый Структура("Параметры, ВычисляемыеПоля, ПоляИтога");
	
	Для каждого КопируемоеСвойство Из КопируемыеСвойства Цикл		
		Для каждого ПараметрИстоник Из СхемаКомпоновкиДанных[КопируемоеСвойство.Ключ] Цикл
			
			ПараметрСКД = СхемаКД[КопируемоеСвойство.Ключ].Добавить();
			ЗаполнитьЗначенияСвойств(ПараметрСКД, ПараметрИстоник);
			
		КонецЦикла;		
	КонецЦикла;
	
	Для каждого ПолеНабора Из СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Поля Цикл
		
		ПолеСКД = СхемаКД.НаборыДанных.НаборДанных1.Поля.Добавить(ТипЗнч(ПолеНабора));
		ЗаполнитьЗначенияСвойств(ПолеСКД, ПолеНабора);
		
	КонецЦикла;		
	
	Для каждого ПараметрСКД Из ПараметрыЗапроса.Параметры Цикл        
				
		ПараметрКД = ТиповыеОтчетыУХ.ДобавитьПараметрВСхему(СхемаКД, ПараметрСКД.Ключ, ПараметрСКД.Значение);
		
		ПараметрКД.ТипЗначения 				= Новый ОписаниеТипов("СправочникСсылка.ДокументыБД");
		ПараметрКД.ВключатьВДоступныеПоля	= Ложь;
		ПараметрКД.ОграничениеИспользования	= Истина;
		
    КонецЦикла;
		
    Возврат СхемаКД;

КонецФункции

Функция ПолучитьНастройкиСКД(НастройкиИсточник, ПараметрыЗапроса)
	
	НастройкиСКД = Новый НастройкиКомпоновкиДанных;
	
	ТиповыеОтчетыУХ.СкопироватьНастройкиКомпоновкиДанных(НастройкиСКД, НастройкиИсточник);
	
	Для каждого ЭлементПараметр Из НастройкиИсточник.ПараметрыДанных.Элементы Цикл
	
		ЭлементПриемник = НастройкиСКД.ПараметрыДанных.Элементы.Добавить();
		ЗаполнитьЗначенияСвойств(ЭлементПриемник, ЭлементПараметр);
			
	КонецЦикла;
	
    Для каждого ПараметрСКД Из ПараметрыЗапроса.Параметры Цикл        
		ПараметрКД = ТиповыеОтчетыУХ.ДобавитьПараметр(НастройкиСКД, ПараметрСКД.Ключ, ПараметрСКД.Значение);		
	КонецЦикла;
	
	СтандартныйПериодОтчета = НастройкиИсточник.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период")).Значение;
	
	НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("Периодичность", ПолучитьПериодичность(СтандартныйПериодОтчета)-1);

	Возврат НастройкиСКД;
	
КонецФункции

Функция ПолучитьПериодичность(СтандартныйПериодОтчета)

	ВидПериода = ВыборПериодаКлиентСервер.ПолучитьВидПериода(СтандартныйПериодОтчета.ДатаНачала, СтандартныйПериодОтчета.ДатаОкончания);
	
	Если ВидПериода = Перечисления.ДоступныеПериодыОтчета.День Тогда		
		Возврат 6;
	ИначеЕсли ВидПериода = Перечисления.ДоступныеПериодыОтчета.Неделя Тогда		
		Возврат 7;	
	ИначеЕсли ВидПериода = Перечисления.ДоступныеПериодыОтчета.Декада Тогда		
		Возврат 8;	
	ИначеЕсли ВидПериода = Перечисления.ДоступныеПериодыОтчета.Месяц Тогда		
		Возврат 9;			
	ИначеЕсли ВидПериода = Перечисления.ДоступныеПериодыОтчета.Квартал Тогда		
		Возврат 10;			
	ИначеЕсли ВидПериода = Перечисления.ДоступныеПериодыОтчета.Полугодие Тогда		
		Возврат 11;
	ИначеЕсли ВидПериода = Перечисления.ДоступныеПериодыОтчета.Год Тогда		
		Возврат 12;
	Иначе
		Возврат 12
	КонецЕсли;
	
КонецФункции

Функция ПолучитьДокументыБД(Знач НастройкиСКД)

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДокументыБД.Ссылка КАК ВидДокумента,
	|	ДокументыБД.Наименование КАК ИмяДокумента,
	|	ТабличныеЧастиБД.Имя КАК ИмяТЧ
	|ИЗ
	|	Справочник.ДокументыБД КАК ДокументыБД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТабличныеЧастиБД КАК ТабличныеЧастиБД
	|		ПО (ТабличныеЧастиБД.Владелец = ДокументыБД.Ссылка)
	|ГДЕ
	|	ДокументыБД.УчастокУчета <> ЗНАЧЕНИЕ(Справочник.УчасткиУчета.ПустаяСсылка)";
	
	НастройкиСКД.Выбор.Элементы.Очистить();		
	ТиповыеОтчетыУХ.ДобавитьВыбранныеПоля(НастройкиСКД.Выбор, Новый Структура("ВидДокумента,ИмяТЧ,ИмяДокумента"));
	
	НастройкиСКД.Структура.Очистить();
	Группировка = ТиповыеОтчетыУХ.ДобавитьГруппировкуСтруктуры(НастройкиСКД, "ВидДокумента");
	ПолеГруппировки = Группировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных("ИмяДокумента");

	ТиповыеОтчетыУХ.ДобавитьГруппировкуСтруктуры(Группировка);
	
	Возврат ТиповыеОтчетыУХ.ПолучитьКоллекциюПоНастройкамКомпоновкиДанных(ТекстЗапроса, НастройкиСКД,,,,,, Новый ДеревоЗначений);

КонецФункции

#Область ТекстЗапросаКД

Функция ПолучитьТекстЗапросаПоДокументамБД(ДокументыБД)
	
	мдДокументы = Метаданные.Документы;
	
	ПараметрыЗапроса = Новый Структура;
	
	ТекстЗапроса_втДокументы = "";
	ТекстЗапроса_втКоличествоСтрок = "";
		
	Для каждого ДокументБД Из ДокументыБД.Строки Цикл
		
		мдДокумент = мдДокументы.Найти(ДокументБД.ИмяДокумента);
		Если мдДокумент = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыЗапроса.Вставить(ДокументБД.ИмяДокумента, ДокументБД.ВидДокумента);
		
		ПервыйЗапрос = ТекстЗапроса_втДокументы = "";
		ТекстЗапроса_втДокументы = ТекстЗапроса_втДокументы + ТекстЗапроса_втДокументы(ПервыйЗапрос, ДокументБД.ИмяДокумента);

		Для каждого ИмяТЧ Из ДокументБД.Строки Цикл
			
			Если мдДокумент.ТабличныеЧасти.Найти(ИмяТЧ.ИмяТЧ) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ПервыйЗапрос = ПервыйЗапрос И (ТекстЗапроса_втКоличествоСтрок = "");			
			ТекстЗапроса_втКоличествоСтрок = ТекстЗапроса_втКоличествоСтрок + ТекстЗапроса_втКоличествоСтрок(ПервыйЗапрос, ДокументБД.ИмяДокумента, ИмяТЧ.ИмяТЧ);
		
		КонецЦикла;
		
	КонецЦикла;

	ТекстЗапроса = ТекстЗапроса_втДокументы + ";" + ТекстЗапросаВнутренний(ТекстЗапроса_втКоличествоСтрок) + ";" + ТекстЗапроса_Результат();

	Возврат Новый Структура("Параметры,Текст", ПараметрыЗапроса, ТекстЗапроса);
	
КонецФункции

Функция ТекстЗапросаВнутренний(ТекстЗапроса_КоличествоСтрок)

	Возврат
	"ВЫБРАТЬ
	|	т.Документ КАК Документ,
	|	СУММА(т.КоличествоСтрок) КАК КоличествоСтрок
	|ПОМЕСТИТЬ втКоличествоСтрок
	|ИЗ
	|	(" + ТекстЗапроса_КоличествоСтрок + ") КАК т
	|СГРУППИРОВАТЬ ПО
	|	т.Документ
	|";
	
КонецФункции

Функция ТекстЗапроса_втДокументы(ПервыйЗапрос, ИмяДокумента)

	Возврат
	
	?(ПервыйЗапрос, "", " ОБЪЕДИНИТЬ ВСЕ ")
	+ "
	|ВЫБРАТЬ
	|	т.Ссылка КАК Документ,
	|	&" + ИмяДокумента + " КАК ВидДокумента"
	+ ?(ПервыйЗапрос, " ПОМЕСТИТЬ втДокументы ", "") +
	"
	|ИЗ
	|	Документ." + ИмяДокумента + " КАК т
	|ГДЕ 
	|	т.Дата МЕЖДУ &ДатаНачалаПериода И &ДатаОкончанияПериода";

КонецФункции

Функция ТекстЗапроса_втКоличествоСтрок(ПервыйЗапрос, ИмяДокумента, ИмяТЧ)

	Возврат
	
	?(ПервыйЗапрос, "", " ОБЪЕДИНИТЬ ВСЕ ")
	+ "
	|ВЫБРАТЬ
	|	т.Ссылка КАК Документ,
	|	КОЛИЧЕСТВО(*) КАК КоличествоСтрок 
	|ИЗ
	|	Документ." + ИмяДокумента + "." + ИмяТЧ + " КАК т
	|
	|СГРУППИРОВАТЬ ПО 
	|	т.Ссылка
	|";

КонецФункции

Функция ТекстЗапроса_Результат()

	Возврат
	"ВЫБРАТЬ
	|	НормативыОтработкиДокументов.Организация,
	|	НормативыОтработкиДокументов.ДокументБД КАК ВидДокумента,
	|	НормативыОтработкиДокументов.Норматив
	|ПОМЕСТИТЬ втНормативы
	|ИЗ
	|	РегистрСведений.НормативыОтработкиДокументов КАК НормативыОтработкиДокументов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДанныеПользователя.Ссылка КАК Пользователь,
	|	МАКСИМУМ(ТекущиеКадровыеДанныеСотрудников.ТекущееПодразделение) КАК Подразделение,
	|	МАКСИМУМ(ТекущиеКадровыеДанныеСотрудников.ТекущаяОрганизация) КАК Организация
	|ПОМЕСТИТЬ втСотрудники
	|ИЗ
	|	РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК ДанныеПользователя
	|		ПО (ДанныеПользователя.Ссылка В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					т.Документ.Ответственный
	|				ИЗ
	|					втДокументы КАК т
	|				ГДЕ
	|					НЕ т.Документ.Ответственный ЕСТЬ NULL ))
	|			И ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо = ДанныеПользователя.ФизическоеЛицо
	|
	|СГРУППИРОВАТЬ ПО
	|	ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо,
	|	ДанныеПользователя.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДокументы.Документ КАК Документ,
	|	втДокументы.Документ.Дата КАК ДатаДокумента,
	|	ВЫБОР
	|		КОГДА &Периодичность < 6 + 1
	|			ТОГДА втДокументы.Документ.Дата
	|		КОГДА &Периодичность = 6 + 1
	|			ТОГДА НАЧАЛОПЕРИОДА(втДокументы.Документ.Дата, ДЕНЬ)
	|		КОГДА &Периодичность = 7 + 1
	|			ТОГДА НАЧАЛОПЕРИОДА(втДокументы.Документ.Дата, НЕДЕЛЯ)
	|		КОГДА &Периодичность = 8 + 1
	|			ТОГДА НАЧАЛОПЕРИОДА(втДокументы.Документ.Дата, ДЕКАДА)
	|		КОГДА &Периодичность = 9 + 1
	|			ТОГДА НАЧАЛОПЕРИОДА(втДокументы.Документ.Дата, МЕСЯЦ)
	|		КОГДА &Периодичность = 10 + 1
	|			ТОГДА НАЧАЛОПЕРИОДА(втДокументы.Документ.Дата, КВАРТАЛ)
	|		КОГДА &Периодичность = 11 + 1
	|			ТОГДА НАЧАЛОПЕРИОДА(втДокументы.Документ.Дата, ПОЛУГОДИЕ)
	|		КОГДА &Периодичность = 12 + 1
	|			ТОГДА НАЧАЛОПЕРИОДА(втДокументы.Документ.Дата, ГОД)
	|	КОНЕЦ КАК ПериодДокумента,
	|	втДокументы.Документ.Организация КАК ОрганизацияПоДокументу,
	|	втСотрудники.Организация КАК ОрганизацияПоСотруднику,
	|	втСотрудники.Подразделение КАК ПодразделениеОрганизации,
	|	втДокументы.ВидДокумента КАК ВидДокумента,
	|	ВЫРАЗИТЬ(втДокументы.ВидДокумента КАК Справочник.ДокументыБД).УчастокУчета КАК УчастокУчета,
	|	втДокументы.Документ.Ответственный КАК Ответственный,
	|	втКоличествоСтрок.КоличествоСтрок КАК КоличествоСтрок,
	|	втНормативы.Норматив КАК Норматив
	|ИЗ
	|	втДокументы КАК втДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКоличествоСтрок КАК втКоличествоСтрок
	|		ПО втДокументы.Документ = втКоличествоСтрок.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ втНормативы КАК втНормативы
	|		ПО втДокументы.Документ.Организация = втНормативы.Организация
	|			И втДокументы.ВидДокумента = втНормативы.ВидДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСотрудники КАК втСотрудники
	|		ПО втДокументы.Документ.Ответственный = втСотрудники.Пользователь"

КонецФункции

#КонецОбласти
